chaoticvoltlabs/Brockian-Ultra-Cricket-panel/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM -- OPI mode (ESP32-S3R8 variant)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Partition table -- custom, 3 MB factory (see partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# CPU
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# LCD
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y

# Stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---- LVGL (Kconfig-driven, no lv_conf.h) ----
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y

# Fonts
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# Perf monitoring (useful for render-quality spike)
CONFIG_LV_USE_OBSERVER=y
